# Cisco Router Basics (IOS)

‡¶è‡¶á README.md ‡¶´‡¶æ‡¶á‡¶≤‡¶ü‡¶ø Cisco Router (IOS) ‡¶è‡¶∞ **basic modes, passwords, configuration, save/reload, ‡¶è‡¶¨‡¶Ç interface setup** ‡¶∏‡¶π‡¶ú‡¶≠‡¶æ‡¶¨‡ßá ‡¶¨‡ßÅ‡¶ù‡¶æ‡¶®‡ßã‡¶∞ ‡¶ú‡¶®‡ßç‡¶Ø ‡¶∏‡¶æ‡¶ú‡¶æ‡¶®‡ßã ‡¶π‡ßü‡ßá‡¶õ‡ßá‡•§ GitHub ‡¶è ‡¶®‡ßã‡¶ü/‡¶∞‡ßá‡¶´‡¶æ‡¶∞‡ßá‡¶®‡ßç‡¶∏ ‡¶π‡¶ø‡¶∏‡ßá‡¶¨‡ßá ‡¶¨‡ßç‡¶Ø‡¶¨‡¶π‡¶æ‡¶∞ ‡¶ï‡¶∞‡¶æ‡¶∞ ‡¶ú‡¶®‡ßç‡¶Ø ‡¶â‡¶™‡¶Ø‡ßÅ‡¶ï‡ßç‡¶§‡•§

---

## 1. Router Modes (Execution Modes)

### ‚ñ∂ User EXEC Mode

```
Router>
```

* Limited access
* ‡¶∂‡ßÅ‡¶ß‡ßÅ **monitoring** ‡¶ï‡¶∞‡¶æ ‡¶Ø‡¶æ‡ßü
* Configuration ‡¶ï‡¶∞‡¶æ ‡¶Ø‡¶æ‡ßü ‡¶®‡¶æ

### ‚ñ∂ Privileged EXEC Mode

```
Router> enable
Router#
```

* Administrator mode
* Configuration, debug, show commands ‡¶¨‡ßç‡¶Ø‡¶¨‡¶π‡¶æ‡¶∞ ‡¶ï‡¶∞‡¶æ ‡¶Ø‡¶æ‡ßü

---

## 2. Configuration Modes

### ‚ñ∂ Global Configuration Mode

```
Router# configure terminal
Router(config)#
```

* Router ‡¶è‡¶∞ overall configuration

### ‚ñ∂ Sub Configuration Modes

#### Console Line Mode

```
Router(config)# line con 0
Router(config-line)#
```

#### VTY Line Mode (Remote Access)

```
Router(config)# line vty 0 4
```

* Virtual Teletype
* ‡¶Æ‡ßã‡¶ü 5‡¶ü‡¶ø port (0‚Äì4)
* Remote login ‡¶è‡¶∞ ‡¶ú‡¶®‡ßç‡¶Ø ‡¶¨‡ßç‡¶Ø‡¶¨‡¶π‡¶æ‡¶∞ ‡¶π‡ßü
* Protocol: `telnet`, `ssh`

---

## 3. Important Show Commands

| Command               | Description                   |
| --------------------- | ----------------------------- |
| `show running-config` | RAM ‡¶•‡ßá‡¶ï‡ßá current config ‡¶¶‡ßá‡¶ñ‡¶æ‡ßü |
| `show startup-config` | NVRAM ‡¶•‡ßá‡¶ï‡ßá saved config ‡¶¶‡ßá‡¶ñ‡¶æ‡ßü |
| `show flash:`         | Flash memory ‡¶è‡¶∞ content ‡¶¶‡ßá‡¶ñ‡¶æ‡ßü |

---

## 4. IOS Service Commands

### ‚ñ∂ Disable Service (Comment ‡¶è‡¶∞ ‡¶Æ‡¶§)

```
no service timestamps log datetime msec
```

* Service active ‡¶•‡¶æ‡¶ï‡ßá ‡¶®‡¶æ

### ‚ñ∂ Spanning Tree

```
spanning-tree mode pvst
```

* Loop prevent ‡¶ï‡¶∞‡¶æ‡¶∞ ‡¶ú‡¶®‡ßç‡¶Ø
* Continuous loop ‡¶¨‡¶®‡ßç‡¶ß ‡¶ï‡¶∞‡ßá

---

## 5. Hostname Configuration

Linux: `touch`
Windows: `mkdir`
Cisco IOS equivalent:

```
Router(config)# hostname Dhaka-North
```

Result:

```
Dhaka-North>
```

---

## 6. Console Password Configuration

```
Dhaka-North> enable
Dhaka-North# configure terminal
Dhaka-North(config)# line con 0
Dhaka-North(config-line)# password 123
Dhaka-North(config-line)# login
Dhaka-North(config-line)# exit
```

> ‚ö†Ô∏è `login` ‡¶®‡¶æ ‡¶¶‡¶ø‡¶≤‡ßá password ‡¶ï‡¶æ‡¶ú ‡¶ï‡¶∞‡¶¨‡ßá ‡¶®‡¶æ

---

## 7. Enable Password vs Enable Secret

### ‚ñ∂ Enable Password

```
Dhaka-North(config)# enable password 456
```

### ‚ñ∂ Enable Secret (Recommended & Strong)

```
Dhaka-North(config)# enable secret asd
```

Example (Encrypted):

```
enable secret 5 $1$mERr$1A6WmlgXdpa7HsGQy66Qd1
```

‚úÖ `enable secret` ‡¶•‡¶æ‡¶ï‡¶≤‡ßá `enable password` ignore ‡¶π‡ßü

---

## 8. Password Encryption (Plain ‚Üí Encrypted)

```
Dhaka-North(config)# service password-encryption
```

* ‡¶∏‡¶¨ plain text password encrypted ‡¶π‡ßü‡ßá ‡¶Ø‡¶æ‡ßü

---

## 9. Change / Remove Password

### ‚ñ∂ Change Console Password

```
configure terminal
line con 0
password NEW_PASSWORD
```

### ‚ñ∂ Remove Password

```
configure terminal
line con 0
no password
```

---

## 10. User vs Privileged Mode Summary

| Mode            | Prompt                 |
| --------------- | ---------------------- |
| User EXEC       | `Router>`              |
| Privileged EXEC | `Router#`              |
| Global Config   | `Router(config)#`      |
| Line Config     | `Router(config-line)#` |

---

## 11. Save Configuration

### ‚ñ∂ RAM ‚Üí NVRAM

```
copy running-config startup-config
```

### ‚ñ∂ Shortcut Commands

```
write memory
write
wr
```

---

## 12. Restart Router

```
reload
```

---

## 13. Interface & IP Configuration

```
Router# configure terminal
Router(config)# hostname Dhaka-North
Dhaka-North(config)# interface GigabitEthernet0/0
Dhaka-North(config-if)# ip address 192.168.1.1 255.255.255.0
Dhaka-North(config-if)# no shutdown
Dhaka-North(config-if)# description To-LAN-SW
```

* `no shutdown` ‚Üí Port ON ‡¶ï‡¶∞‡ßá
* `description` ‚Üí Documentation purpose

---

## 14. Memory Types Summary

| Memory | Usage                 |
| ------ | --------------------- |
| RAM    | Running Configuration |
| NVRAM  | Startup Configuration |
| Flash  | IOS Image             |

---

## ‚úÖ End Notes

‡¶è‡¶á README ‡¶ü‡¶ø **Cisco CCNA / Lab Practice / Exam Prep** ‡¶è‡¶∞ ‡¶ú‡¶®‡ßç‡¶Ø perfect reference‡•§

üìå You can extend this with:

* SSH configuration
* Static & Dynamic Routing
* VLAN & Trunk
* NAT

---

‚≠ê If this helps, feel free to fork & star the repo!
